app/Controllers/StudentsController.php

    public function index()
    {
        $fetchStudent = new StudentsModel();
        $data['students'] = $fetchStudent->findAll();
---
SELECT *
FROM `tbl_students`

    public function storeStudent()
    {
        //Store the student
        $insertStudent = new StudentsModel();

        $data = array(
            'id' => $this->request->getpost('studentId'),
            'student_name' => $this->request->getpost('studentName'),
            'student_lastname' => $this->request->getpost('studentLastname'),
            'student_contact' => $this->request->getpost('studentContact'),
            'student_course' => $this->request->getpost('studentCourse'),
            'student_year' => $this->request->getpost('studentYear'),
            'student_section' => $this->request->getpost('studentSection'),
        );
        $insertStudent->insert($data);
---
INSERT INTO `tbl_students` (`student_name`, `student_lastname`, `student_contact`, `student_course`, `student_year`, `student_section`) VALUES ('James', 'Fallon', '09345321567', 'BSCRIM', '3RD', 'BSCRIM501')

    public function editStudent($id)
    {
        $fetchStudent = new StudentsModel();
        $data['student'] = $fetchStudent->where('id',$id)->first();
---
SELECT *
FROM `tbl_students`
WHERE `id` = '20'
 LIMIT 1

    public function deleteStudent($id)
    {
        //Delete the student
        $deleteStudent = new StudentsModel();
        $deleteStudent->delete($id);
---
DELETE FROM `tbl_students`
WHERE `id` IN ('12')